{
  "contents": "<p><b>DESCRIPTION</b><br><br> It's no secret that Amazon relies on its technology to deliver millions of packages every day to its customers  on time, with low cost. The Middle Mile Transportation Technology organization, builds complex software solutions that work across our vendors, warehouses and carriers to optimize both time &amp; cost of getting the packages delivered. Our services already handle thousands of requests per second, make business choices impacting billions of dollars a year, integrate with a network of small and large carriers, manage business rules for movements of millions of products, and improve our middle mile operations experience to deliver products for millions of online shoppers. That said, this remains a fast growing business and our technical journey has only started.<br>Amazon's global fulfillment network enables any merchant in any of the geography ship items that you order on Amazon, to any place on earth. There are a variety of ways in which we can acquire items from vendors to our warehouses, ship items from one location to another, and several intermediate locations through which the package travels before reaching the customer. There are millions of such packages, each with different attributes, and different delivery requirements. What results is a highly dense graph of source, intermediate and destination nodes, with arcs between them representing possible paths for packages, with different costs and times along each arc. Accounting for all these constraints, and maximizing the number of shipments shipped, while minimizing cost, providing a variety of delivery options and maximizing delivery performance is Transportation Engineering's primary focus.<br><br>Our mission is to build the most efficient and optimal transportation solution on the planet, using our technology and engineering muscle as our biggest advantage. We aim to leverage cutting edge technologies in big data, machine learning, and optimization techniques, and operate high volume, low latency, and high availability services.<br>Come and see for yourself why we are one of the most admired company in the US, rated #1 in Innovation and # 1 in Customer Service, and be part of our tradition of working hard, having fun and making history!<br><br> <b>BASIC QUALIFICATIONS</b> <br><br> •  2+ years of non-internship professional software development experience<br>•  Programming experience with at least one modern language such as Java, C++, or C# including object-oriented design<br>•  1+ years of experience contributing to the architecture and design (architecture, design patterns, reliability and scaling) of new and current systems.<br><br> <b>PREFERRED QUALIFICATIONS </b> <br><br> •  5+ years professional experience in commercial or web-scale system software development and delivery<br>•  Proficient in network, distributed, asynchronous and concurrent programming<br>•  Experience designing, building and delivering high quality software on time<br>•  Experience taking a leading role in building complex software systems that have been successfully delivered to customers<br>•  Knowledge of professional software engineering practices &amp; best practices for the full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations<br>•  Experience with distributed computing and enterprise-wide systems<br>•  Experience in communicating with users, other technical teams, and senior management to collect requirements, describe software product features, technical designs, and product strategy<br>•  Experience mentoring junior software engineers to improve their skills, and make them more effective, product software engineers<br>•  Experience influencing software engineers best practices within your team<br>•  Hands-on expertise in many disparate technologies, typically ranging from front-end user interfaces through to back-end systems and all points in between<br>•  Experience working in an Agile/Scrum environment<br>•  Obsessed with addressing customer needs<br><br>By submitting your application here, you can apply once to be considered for multiple Software Engineer openings across various Amazon teams. If you are successful in passing through the initial application review and assessment, you will be asked to submit your career and personal preferences so that our dedicated recruiters can match you to the right role based on these preferences.<br><br>Amazon is committed to a diverse and inclusive workplace. Amazon is an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status. For individuals with disabilities who would like to request an accommodation, visit https://www.amazon.jobs/en/disability/us .</p>",
  "name": "Software Development Engineer - Middle Mile Transportation Technology",
  "type": "external",
  "publication_date": "2021-08-13T23:47:10Z",
  "short_name": "software-development-engineer-middle-mile-transportation-technology",
  "model_type": "jobs",
  "id": 5936349,
  "locations": [{ "name": "Bellevue, WA" }, { "name": "Remote" }],
  "categories": [{ "name": "Software Engineer" }],
  "levels": [{ "name": "Senior Level", "short_name": "senior" }],
  "tags": [],
  "refs": {
    "landing_page": "https://www.themuse.com/jobs/amazon/software-development-engineer-middle-mile-transportation-technology"
  },
  "company": { "id": 12090, "short_name": "amazon", "name": "Amazon" }
}
